app/Controllers/DatasetupController.php

SELECT *
FROM `Category`
---
    public function index()
    {
        $Cate_model=new CategoryModel();
        $data['category']=$Cate_model->FindAll();

INSERT INTO `Category` (`id`, `cate_name`, `des`) VALUES ('', '', '')
---
    public function save_category(){
        $category=new CategoryModel();
       // $add_by=session('username');
       $data=array(
           'id'=>$this->request->getPost('txtid'),
           'cate_name'=>$this->request->getPost('cate_name'),
           'des'=>$this->request->getPost('des'),
       );
       if ($category->insert($data)) {

SELECT *
FROM `Category`
WHERE `Category`.`id` = '8'
DELETE FROM `Category`
WHERE `id` IN ('8')
---
   public function delete_category($id){
       $category=new CategoryModel();
       $data=$category->find($id);
       $category->delete($id);

SELECT *
FROM `Category`
WHERE `Category`.`id` = '6'
---
   public function edit_category($id){
       $category=new CategoryModel();
       $data=$category->find($id);